import type { PetPrompt } from '@/types/prompt'

export const petPrompts: PetPrompt[] = [
  {
    id: '1',
    prompt: '把背景改成蓝色背景 墙上贴着史迪仔logo 地毯要史迪仔配色 旁边放着史迪仔公仔 小猫头上带着史迪仔系列帽子做出可爱的表情看着镜头身上衣服可以改变 表情可爱 猫窝变成史迪仔系列毛绒样子 原本脖子上的项圈换成蓝色项圈。',
    imageUrl: '/images/1.jpg',
  },
  {
    id: '2',
    prompt: '把背景改成红色 墙上贴着玩具总动员海报 地毯要棕色 旁边有玩具总动玩的玩具 宠物头上带着胡迪的帽子 做出可爱的表情看着镜头身上衣服可以改变 表情可爱',
    imageUrl: '/images/2.jpg',
  },
  {
    id: '3',
    prompt: '图中的猫咪先坐直身子，头戴着印有‘FARMER BOB’字样、带有卡通小鸡和圆滚滚动物图案的牛皮纸袋头套，身穿着浅色衣物，保持平静的神态；猫咪眼神明亮且充满童真，整体风格温馨治愈、充满童趣，画面细节丰富且色彩柔和。并抠出图中猫身影，背景改粉红色。',
    imageUrl: '/images/3.jpg',
  },
  {
    id: '4',
    prompt: '把背景改成黄色 墙上贴着海绵宝宝派大星 地毯要浅黄色  旁边有海绵宝宝和派大星和海绵宝宝动画片里的一些玩具 小猫头上带着可爱的海绵宝宝帽子做出可爱的表情看着镜头身上衣服可以改变 表情可爱 猫窝变成海绵宝宝的黄色毛绒绒样子',
    imageUrl: '/images/4.jpg',
  },
  {
    id: '5',
    prompt: '把背景改成玩具总动员背景，墙上贴着一些玩具总动员暴暴龙系列贴纸或者海报，地毯要绿色系列配色，旁边放着暴暴龙系列公仔。小猫头上带暴暴龙系列毛绒帽子，做出可爱的表情看着镜头。身上衣服改为暴暴龙同系列。表情可爱。猫窝变成玩具总动员系列毛绒样子。',
    imageUrl: '/images/5.jpg',
  },
  {
    id: '6',
    prompt: '把背景改成牛仔蓝风格色 墙上贴着卡通牛仔玩偶 地毯要蓝色系牛仔旁边可爱牛仔玩偶和蓝色玩具 宠物头上带着可爱的帽子做出可爱的表情看着镜头 动作多变 表情多变身上衣服偏蓝色系牛仔吊带衣可以改变 表情多变可爱 身下变成牛仔色系狗窝毛绒绒样子',
    imageUrl: '/images/6.jpg',
  },
  {
    id: '7',
    prompt: '将背景改为暗红色 墙上贴哈利波特海报 铺深棕色地毯 旁边放几瓶魔法药水 图片左边放上魔法书架 给宠物戴上巫师的帽子 让它做出可爱表情看着镜头并改变身上衣服为魔法风格',
    imageUrl: '/images/7.jpg',
  },
  {
    id: '8',
    prompt: '把背景改成粉红色 墙上贴着HelloKitty 地毯要浅粉色旁边有HelloKitty和美乐蒂玩具 宠物头上带着可爱的帽子做出可爱的表情看着镜头身上衣服可以改变 表情可爱 狗窝变成HelloKitty的粉色毛绒绒样子',
    imageUrl: '/images/8.jpg',
  },
  {
    id: '9',
    prompt: '头戴红色带有黄色“M”标志的帽子，身穿黄色上衣搭配红色背带裤 道具与背景：坐在白色毛绒座椅上；左侧有红色带笑脸的薯条毛绒玩具和多层汉堡模型，左后方有红色的麦当劳标志（黄色“M”及部分白色字母）背景为浅棕色与深棕色平面，右侧还有小型薯条毛绒玩具宠物状态：表情呆萌一句话总结:宠物身着麦当劳主题服饰，坐在白色毛绒座椅上，在布满麦当劳标志、薯条和汉堡道具的场景中呆萌。',
    imageUrl: '/images/9.jpg',
  },
  {
    id: '10',
    prompt: '保持+脸不变，生成一套复古风宠物写真，粉色背景，宠物头戴粉色格纹头巾（自剂包裹头部），漏出耳朵，身穿粉色背带裤，一个人手持一颗切一半的芭乐置于宠物脸颊一侧，宠物表情眨眼吐舌，表情俏皮，画面色彩浓郁且对比强烈，风格童趣复古，比例适配宠物像特写，细节写实',
    imageUrl: '/images/10.jpg',
  },
  {
    id: '11',
    prompt: '把背景改成黄色 墙上挂着带珍珠耳环的少女油画   椭圆形相框   ，地毯要粗布质感 小猫头上带着带珍珠耳环的少女的头巾 做出可爱的表情 ，身上衣服可以改变，最好是和珍珠耳环的少女配色和风格 小猫脚下放一张深色地毯，旁边摆放复古花瓶和少许散落的首饰，整体风格复古风',
    imageUrl: '/images/11.jpg',
  },
  {
    id: '12',
    prompt: '以前景遮挡构图呈现的清新田园风格画面中，小猫身着天蓝色带白色蕾丝边衣物，立于白色背景前，头戴有蓝色迎春花的天蓝色印花镂空蕾丝头巾，脸上点缀小迎春花，身旁有小迎春花。',
    imageUrl: '/images/12.jpg',
  },
  {
    id: '13',
    prompt: '室内复古奢华场景，背景是深棕色的布料，营造出沉稳且富有质感的氛围。画面中有精致的金色雕花相框，相框内铺有浅米色的薄纱，周围环绕着多束色彩柔和的花朵（包括浅棕色、米白色等色调的玫瑰等品种），增添了浪漫优雅的感觉。宠物座在相框内的薄纱上，头戴蓝黄相间的头饰，穿着棕色的连体衣，佩戴多层白色珍珠项链，。整体画面风格复古奢华、充满艺术感，光线柔和，画质高清，细节丰富，营造出高贵美好的氛围。',
    imageUrl: '/images/13.jpg',
  },
  {
    id: '14',
    prompt: '把背景改成法式灰色浮雕墙 墙上挂着两大片对称的黑色纱幔 浮雕墙前面挂着一大串扎着黑色缎面蝴蝶结珍珠珠帘 地毯要黑色羽毛 旁边有 法式复古落地大银镜 和黑珍珠项链 还有法式复古雕花烛台 还有 法式钻石吊坠落地灯  和小的法式复古雕花银镜 宠物戴着黑珍珠缎面大蝴蝶结钻石皇冠 做出可爱的表情看着镜头 穿着黑色缎面黑珍珠钻石高领超大纱幔的黑色三层蕾丝超长大摆尾婚纱 胸前戴着黑珍珠钻石项链 背上背一对黑色羽毛超大翅膀 表情可爱 狗窝变成黑色缎面羽毛地毯 毛绒绒样子 地毯上洒落着黑珍珠 还有一个大的法式复古银盘里装满了洒落的黑珍珠和散落的黑色羽毛',
    imageUrl: '/images/14.jpg',
  },
  {
    id: '15',
    prompt: '一只可爱的宠物，头上戴着彩色卷发器，身穿白色蕾丝领上衣、黄色背带裤，坐在木质桌面上，身旁有红色 rotary phone（旋转拨号电话），背景是贴有复古风格海报的绿色墙面，复古童趣风格，宠物摄影，创意复古主题场景',
    imageUrl: '/images/15.jpg',
  },
  {
    id: '16',
    prompt: '在明亮的橙色背景下，宠物坐在蓝色毛毡织物上。开心的漏出舌头，宠物没有尾巴，宠物歪头，身穿红色连帽雨衣斗篷，斗篷用红白绳系着，帽子尖尖立起来，顶着浅黄色毛绒球球，身旁放着三只棕色的毛绒小熊玩偶，小熊玩偶围着可爱的红白色格子蕾丝花边围兜，小熊玩偶有大有小，上方有一朵超大蓬松的白云，正落下毛毡质感的蓝色雨滴，整体充满童趣与创意。',
    imageUrl: '/images/16.jpg',
  },
  {
    id: '17',
    prompt: '宠物穿蕾丝头巾，碎花元素，蹲坐着，表情要可爱，去掉原图背景和其他物品，图片宠物穿戴可爱发夹。宠物站在一幅与它穿着打扮一致的素描画前，素描画置于画架上，背景为室内画室环境，摆放有其他画作',
    imageUrl: '/images/17.jpg',
  },
  {
    id: '18',
    prompt: '帮我把这张照片里面的宠物表情和毛色不变，主体是宠物戴着灰色鲨鱼头套的毛绒玩具，头套有黑色圆眼睛、白色嘴部；无人物；主体放置在白色盒子里，旁边有人手持印有同款戴鲨鱼头套宠物卡通形象的卡片，卡片背景是彩色放射状光线；场景氛围明亮，像室内展示物品的场景；构图为平视角度，清晰展示盒子、毛绒玩具和卡片；艺术风格偏向写实与卡通结合，毛绒玩具写实，卡片图案卡通；图像质量高清，细节清晰；',
    imageUrl: '/images/18.jpg',
  },
  {
    id: '19',
    prompt: '主体保持不变。给宠物戴浅米色粗针织帽，穿着黑色短袖连体衣，架着白色大耳机。坐在浅米色针织毯上，周围有磁带、画报错落摆放。背景墙随意贴着复古海报，左侧有黑胶唱片，右侧有棕色木纹吉他，复古与现代元素融合，童趣十足。光线柔和温暖',
    imageUrl: '/images/19.jpg',
  },
  {
    id: '20',
    prompt: '给宠物戴上棕色系绳帽，帽子精心呈现出杰瑞的脸部形象，还有大大的耳朵，头顶还点缀着一块奶酪造型的装饰。场景更换为围绕《猫和老鼠》主题打造的宠物摄影场景，背景是清新的纯蓝色。地面是米色地毯。左上方印着“CHEESE! DAY”字样的装饰，字是倾斜的，字母像奶酪一样是橙黄底带黄色圆点，或者黄色底带橙黄圆点。右上角增加一个大大的奶酪造型的毛绒玩偶，上面印着汤姆猫的脸，还带汤姆猫的腿和尾巴。宠物左边增加一个杰瑞鼠造型的毛绒玩偶，形象可爱；宠物右边增加“OPT GRANOLA”谷物盒等物品。',
    imageUrl: '/images/20.jpg',
  }
]