import type { PetPrompt } from '@/types/prompt'

export const petPrompts: PetPrompt[] = [
  {
    id: '1',
    prompt: '把背景改成蓝色背景 墙上贴着史迪仔logo 地毯要史迪仔配色 旁边放着史迪仔公仔 小猫头上带着史迪仔系列帽子做出可爱的表情看着镜头身上衣服可以改变 表情可爱 猫窝变成史迪仔系列毛绒样子 原本脖子上的项圈换成蓝色项圈。原比例。',
    imageUrl: '/images/1.jpg',
  },
  {
    id: '2',
    prompt: '把背景改成红色 墙上贴着玩具总动员海报 地毯要棕色 旁边有玩具总动玩的玩具 小狗头上带着胡迪的帽子 做出可爱的表情看着镜头身上衣服可以改变 表情可爱',
    imageUrl: '/images/2.jpg',
  },
  {
    id: '3',
    prompt: '图中的猫咪先坐直身子，头戴着印有‘FARMER BOB’字样、带有卡通小鸡和圆滚滚动物图案的牛皮纸袋头套，身穿着浅色衣物，保持平静的神态；猫咪眼神明亮且充满童真，整体风格温馨治愈、充满童趣，画面细节丰富且色彩柔和。并抠出图中猫身影，背景改粉红色。',
    imageUrl: '/images/3.jpg',
  },
  {
    id: '4',
    prompt: '把背景改成黄色 墙上贴着海绵宝宝派大星 地毯要浅黄色  旁边有海绵宝宝和派大星和海绵宝宝动画片里的一些玩具 小猫头上带着可爱的海绵宝宝帽子做出可爱的表情看着镜头身上衣服可以改变 表情可爱 猫窝变成海绵宝宝的黄色毛绒绒样子',
    imageUrl: '/images/4.jpg',
  },
  {
    id: '5',
    prompt: '把背景改成玩具总动员背景，墙上贴着一些玩具总动员暴暴龙系列贴纸或者海报，地毯要绿色系列配色，旁边放着暴暴龙系列公仔。小猫头上带暴暴龙系列毛绒帽子，做出可爱的表情看着镜头。身上衣服改为暴暴龙同系列。表情可爱。猫窝变成玩具总动员系列毛绒样子。',
    imageUrl: '/images/5.jpg',
  },
  {
    id: '6',
    prompt: '把背景改成牛仔蓝风格色 墙上贴着卡通牛仔玩偶 地毯要蓝色系牛仔旁边可爱牛仔玩偶和蓝色玩具 小狗头上带着可爱的帽子做出可爱的表情看着镜头 动作多变 表情多变身上衣服偏蓝色系牛仔吊带衣可以改变 表情多变可爱 身下变成牛仔色系狗窝毛绒绒样子',
    imageUrl: '/images/6.jpg',
  },
  {
    id: '7',
    prompt: '将背景改为暗红色 墙上贴哈利波特海报 铺深棕色地毯 旁边放几瓶魔法药水 图片左边放上魔法书架 给小狗戴上巫师的帽子 让它做出可爱表情看着镜头并改变身上衣服为魔法风格',
    imageUrl: '/images/7.jpg',
  },
  {
    id: '8',
    prompt: '把背景改成粉红色 墙上贴着HelloKitty 地毯要浅粉色旁边有HelloKitty和美乐蒂玩具 宠物头上带着可爱的帽子做出可爱的表情看着镜头身上衣服可以改变 表情可爱 狗窝变成HelloKitty的粉色毛绒绒样子',
    imageUrl: '/images/8.jpg',
  },
  {
    id: '9',
    prompt: '头戴红色带有黄色“M”标志的帽子，身穿黄色上衣搭配红色背带裤 道具与背景：坐在白色毛绒座椅上；左侧有红色带笑脸的薯条毛绒玩具和多层汉堡模型，左后方有红色的麦当劳标志（黄色“M”及部分白色字母）背景为浅棕色与深棕色平面，右侧还有小型薯条毛绒玩具宠物状态：表情呆萌一句话总结:宠物身着麦当劳主题服饰，坐在白色毛绒座椅上，在布满麦当劳标志、薯条和汉堡道具的场景中呆萌。',
    imageUrl: '/images/9.jpg',
  },
  {
    id: '10',
    prompt: '保持+脸不变，生成一套复古风宠物写真，粉色背景，宠物头戴粉色格纹头巾（自剂包裹头部），漏出耳朵，身穿粉色背带裤，一个人手持一颗切一半的芭乐置于宠物脸颊一侧，宠物表情眨眼吐舌，表情俏皮，画面色彩浓郁且对比强烈，风格童趣复古，比例适配宠物像特写，细节写实',
    imageUrl: '/images/10.jpg',
  }
]