import type { PetPrompt } from '@/types/prompt'

export const petPrompts: PetPrompt[] = [
    {
        id: '1',
        prompt: '把背景改成蓝色背景 墙上贴着史迪仔logo 地毯要史迪仔配色 旁边放着史迪仔公仔 小猫头上带着史迪仔系列帽子做出可爱的表情看着镜头身上衣服可以改变 表情可爱 猫窝变成史迪仔系列毛绒样子 原本脖子上的项圈换成蓝色项圈。',
        imageUrl: '/images/1.jpg'
    },
    {
        id: '2',
        prompt: '把背景改成红色 墙上贴着玩具总动员海报 地毯要棕色 旁边有玩具总动玩的玩具 宠物头上带着胡迪的帽子 做出可爱的表情看着镜头身上衣服可以改变 表情可爱',
        imageUrl: '/images/2.jpg'
    },
    {
        id: '3',
        prompt: '图中的猫咪先坐直身子，头戴着印有‘FARMER BOB’字样、带有卡通小鸡和圆滚滚动物图案的牛皮纸袋头套，身穿着浅色衣物，保持平静的神态；猫咪眼神明亮且充满童真，整体风格温馨治愈、充满童趣，画面细节丰富且色彩柔和。并抠出图中猫身影，背景改粉红色。',
        imageUrl: '/images/3.jpg'
    },
    {
        id: '4',
        prompt: '把背景改成黄色 墙上贴着海绵宝宝派大星 地毯要浅黄色  旁边有海绵宝宝和派大星和海绵宝宝动画片里的一些玩具 小猫头上带着可爱的海绵宝宝帽子做出可爱的表情看着镜头身上衣服可以改变 表情可爱 猫窝变成海绵宝宝的黄色毛绒绒样子',
        imageUrl: '/images/4.jpg'
    },
    {
        id: '5',
        prompt: '把背景改成玩具总动员背景，墙上贴着一些玩具总动员暴暴龙系列贴纸或者海报，地毯要绿色系列配色，旁边放着暴暴龙系列公仔。小猫头上带暴暴龙系列毛绒帽子，做出可爱的表情看着镜头。身上衣服改为暴暴龙同系列。表情可爱。猫窝变成玩具总动员系列毛绒样子。',
        imageUrl: '/images/5.jpg'
    },
    {
        id: '6',
        prompt: '把背景改成牛仔蓝风格色 墙上贴着卡通牛仔玩偶 地毯要蓝色系牛仔旁边可爱牛仔玩偶和蓝色玩具 宠物头上带着可爱的帽子做出可爱的表情看着镜头 动作多变 表情多变身上衣服偏蓝色系牛仔吊带衣可以改变 表情多变可爱 身下变成牛仔色系猫窝毛绒绒样子',
        imageUrl: '/images/6.jpg'
    },
    {
        id: '7',
        prompt: '将背景改为暗红色 墙上贴哈利波特海报 铺深棕色地毯 旁边放几瓶魔法药水 图片左边放上魔法书架 给宠物戴上巫师的帽子 让它做出可爱表情看着镜头并改变身上衣服为魔法风格',
        imageUrl: '/images/7.jpg'
    },
    {
        id: '8',
        prompt: '把背景改成粉红色 墙上贴着HelloKitty 地毯要浅粉色旁边有HelloKitty和美乐蒂玩具 宠物头上带着可爱的帽子做出可爱的表情看着镜头身上衣服可以改变 表情可爱 猫窝变成HelloKitty的粉色毛绒绒样子',
        imageUrl: '/images/8.jpg'
    },
    {
        id: '9',
        prompt: '头戴红色带有黄色“M”标志的帽子，身穿黄色上衣搭配红色背带裤 道具与背景：坐在白色毛绒座椅上；左侧有红色带笑脸的薯条毛绒玩具和多层汉堡模型，左后方有红色的麦当劳标志（黄色“M”及部分白色字母）背景为浅棕色与深棕色平面，右侧还有小型薯条毛绒玩具宠物状态：表情呆萌一句话总结:宠物身着麦当劳主题服饰，坐在白色毛绒座椅上，在布满麦当劳标志、薯条和汉堡道具的场景中呆萌。',
        imageUrl: '/images/9.jpg'
    },
    {
        id: '10',
        prompt: '保持+脸不变，生成一套复古风宠物写真，粉色背景，宠物头戴粉色格纹头巾（自剂包裹头部），漏出耳朵，身穿粉色背带裤，一个人手持一颗切一半的芭乐置于宠物脸颊一侧，宠物表情眨眼吐舌，表情俏皮，画面色彩浓郁且对比强烈，风格童趣复古，比例适配宠物像特写，细节写实',
        imageUrl: '/images/10.jpg'
    },
    {
        id: '11',
        prompt: '把背景改成黄色 墙上挂着带珍珠耳环的少女油画   椭圆形相框   ，地毯要粗布质感 小猫头上带着带珍珠耳环的少女的头巾 做出可爱的表情 ，身上衣服可以改变，最好是和珍珠耳环的少女配色和风格 小猫脚下放一张深色地毯，旁边摆放复古花瓶和少许散落的首饰，整体风格复古风',
        imageUrl: '/images/11.jpg'
    },
    {
        id: '12',
        prompt: '以前景遮挡构图呈现的清新田园风格画面中，小猫身着天蓝色带白色蕾丝边衣物，立于白色背景前，头戴有蓝色迎春花的天蓝色印花镂空蕾丝头巾，脸上点缀小迎春花，身旁有小迎春花。',
        imageUrl: '/images/12.jpg'
    },
    {
        id: '13',
        prompt: '室内复古奢华场景，背景是深棕色的布料，营造出沉稳且富有质感的氛围。画面中有精致的金色雕花相框，相框内铺有浅米色的薄纱，周围环绕着多束色彩柔和的花朵（包括浅棕色、米白色等色调的玫瑰等品种），增添了浪漫优雅的感觉。宠物座在相框内的薄纱上，头戴蓝黄相间的头饰，穿着棕色的连体衣，佩戴多层白色珍珠项链，。整体画面风格复古奢华、充满艺术感，光线柔和，画质高清，细节丰富，营造出高贵美好的氛围。',
        imageUrl: '/images/13.jpg'
    },
    {
        id: '14',
        prompt: '把背景改成法式灰色浮雕墙 墙上挂着两大片对称的黑色纱幔 浮雕墙前面挂着一大串扎着黑色缎面蝴蝶结珍珠珠帘 地毯要黑色羽毛 旁边有 法式复古落地大银镜 和黑珍珠项链 还有法式复古雕花烛台 还有 法式钻石吊坠落地灯  和小的法式复古雕花银镜 宠物戴着黑珍珠缎面大蝴蝶结钻石皇冠 做出可爱的表情看着镜头 穿着黑色缎面黑珍珠钻石高领超大纱幔的黑色三层蕾丝超长大摆尾婚纱 胸前戴着黑珍珠钻石项链 背上背一对黑色羽毛超大翅膀 表情可爱 猫窝变成黑色缎面羽毛地毯 毛绒绒样子 地毯上洒落着黑珍珠 还有一个大的法式复古银盘里装满了洒落的黑珍珠和散落的黑色羽毛',
        imageUrl: '/images/14.jpg'
    },
    {
        id: '15',
        prompt: '一只可爱的宠物，头上戴着彩色卷发器，身穿白色蕾丝领上衣、黄色背带裤，坐在木质桌面上，身旁有红色 rotary phone（旋转拨号电话），背景是贴有复古风格海报的绿色墙面，复古童趣风格，宠物摄影，创意复古主题场景',
        imageUrl: '/images/15.jpg'
    },
    {
        id: '16',
        prompt: '在明亮的橙色背景下，宠物坐在蓝色毛毡织物上。开心的漏出舌头，宠物没有尾巴，宠物歪头，身穿红色连帽雨衣斗篷，斗篷用红白绳系着，帽子尖尖立起来，顶着浅黄色毛绒球球，身旁放着三只棕色的毛绒小熊玩偶，小熊玩偶围着可爱的红白色格子蕾丝花边围兜，小熊玩偶有大有小，上方有一朵超大蓬松的白云，正落下毛毡质感的蓝色雨滴，整体充满童趣与创意。',
        imageUrl: '/images/16.jpg'
    },
    {
        id: '17',
        prompt: '宠物穿蕾丝头巾，碎花元素，蹲坐着，表情要可爱，去掉原图背景和其他物品，图片宠物穿戴可爱发夹。宠物站在一幅与它穿着打扮一致的素描画前，素描画置于画架上，背景为室内画室环境，摆放有其他画作',
        imageUrl: '/images/17.jpg'
    },
    {
        id: '18',
        prompt: '帮我把这张照片里面的宠物表情和毛色不变，主体是宠物戴着灰色鲨鱼头套的毛绒玩具，头套有黑色圆眼睛、白色嘴部；无人物；主体放置在白色盒子里，旁边有人手持印有同款戴鲨鱼头套宠物卡通形象的卡片，卡片背景是彩色放射状光线；场景氛围明亮，像室内展示物品的场景；构图为平视角度，清晰展示盒子、毛绒玩具和卡片；艺术风格偏向写实与卡通结合，毛绒玩具写实，卡片图案卡通；图像质量高清，细节清晰；',
        imageUrl: '/images/18.jpg'
    },
    {
        id: '19',
        prompt: '主体保持不变。给宠物戴浅米色粗针织帽，穿着黑色短袖连体衣，架着白色大耳机。坐在浅米色针织毯上，周围有磁带、画报错落摆放。背景墙随意贴着复古海报，左侧有黑胶唱片，右侧有棕色木纹吉他，复古与现代元素融合，童趣十足。光线柔和温暖',
        imageUrl: '/images/19.jpg'
    },
    {
        id: '20',
        prompt: '给宠物戴上棕色系绳帽，帽子精心呈现出杰瑞的脸部形象，还有大大的耳朵，头顶还点缀着一块奶酪造型的装饰。场景更换为围绕《猫和老鼠》主题打造的宠物摄影场景，背景是清新的纯蓝色。地面是米色地毯。左上方印着“CHEESE! DAY”字样的装饰，字是倾斜的，字母像奶酪一样是橙黄底带黄色圆点，或者黄色底带橙黄圆点。右上角增加一个大大的奶酪造型的毛绒玩偶，上面印着汤姆猫的脸，还带汤姆猫的腿和尾巴。宠物左边增加一个杰瑞鼠造型的毛绒玩偶，形象可爱；宠物右边增加“OPT GRANOLA”谷物盒等物品。',
        imageUrl: '/images/20.jpg'
    },
    {
        id: '21',
        prompt: '豪华的宫廷风背景，在复古的台面上坐着一只小猫，穿着公主的服饰，头戴白色皇冠周围是皇室的布景，氛围感十足。整体成古典油画质感',
        imageUrl: '/images/21.jpg'
    },
    {
        id: '22',
        prompt: '宠物写真，保持小猫+脸不变，穿碎花裙，没有配饰，脖子上围着符合秋天氛围的针织围巾。小猫在一片开满橙黄色花朵的草地上奔跑，在落日余晖下被风吹起的毛都在发光，模样十分俏皮灵动，整体画面充满了秋日的温暖与活泼氛围，比例适配宠物像远景，拍到小猫侧面，细节写实',
        imageUrl: '/images/22.jpg'
    },
    {
        id: '23',
        prompt: '以我的小猫为主为浅橙色为背景，采用九宫格排版，展示了这一只小猫的九种不同面包主题装扮状态。第一排从左到右，宠物先是戴吐司小帽子吐舌，露出可爱的模样；接着穿面包纹小衣服歪头，似在卖萌；然后戴牛角包小发箍蹭脸，神情略显呆萌。第二排，宠物先穿法棍图案小卫衣坐好，保持乖巧神态；随后戴甜甜圈小发带晃头，仿佛在玩耍；之后穿三明治纹小背带裤站立，露出活泼的样子。第三排，宠物先是戴小面包小发卡睁眼，呈现精神的状态；接着戴肉松小发圈打哈欠，尽显慵懒；最后蹭着面包主题垫子，露出温顺的神情。每一种面包主题装扮状态都生动鲜活，将宠物的 “小呆萌” 细腻展现。真实写真。',
        imageUrl: '/images/23.jpg'
    },
    {
        id: '24',
        prompt: '将图片改成以米白色纯色背景呈现，采用九宫格排版，展示宠物的九种秋季主题造型。第一排从左到右，宠物先戴小枫叶发夹吐舌，接着穿焦糖色小毛衣坐直，然后戴棕色小围巾蹭身；第二排，宠物先叼小枫叶（仿真款）跑跳，接着穿棕色小外套（迷你款）歪头，然后戴小栗子项圈打哈欠；第三排，宠物先趴焦糖色小垫子（简约款）抬头，接着戴小银杏叶发带低头，然后咬小栗子玩具（迷你款）兴奋。秋季氛围温暖',
        imageUrl: '/images/24.jpg'
    },
    {
        id: '25',
        prompt: '画面中，一个可爱的猫坐在浅绿色的背景前。小猫头戴绿白格子的头巾，身上穿着一件绿色带口袋的背心，画面中有一只手拿了一个串葡萄放在猫猫脸颊两边。整体画面充满了童真与甜美，绿色系的搭配营造出温馨柔和的氛围，将小猫的天真烂漫展现得淋漓尽致。',
        imageUrl: '/images/25.jpg'
    },
    {
        id: '26',
        prompt: '保持小猫五官和毛发质感造型不变。生成一张90年代复古disco写真。小猫穿港风花衬衫，垂下的耳朵长毛变卷，头上扎红色底白色波点发带，白色框猫眼墨镜，微微歪头，表情酷拽俏皮。背景包含disco灯球、霓虹灯管、写有“NO DISCO NO LIFE”的霓虹灯牌、丰富镭射流苏、红色复古录音机，黑白格子地板，有亮片碎纸从空中飘落，整体为90年代香港歌舞厅热闹的灯红酒绿氛围。灯球纹理细节质感真实。',
        imageUrl: '/images/26.jpg'
    },
    {
        id: '27',
        prompt: '保持小猫造型不变，生成一套复古宠物写真，水泥墙背景。小猫服饰参考《这个杀手不太冷》中玛蒂尔达穿着，黑色V领内搭，低饱和度绿色夹克，黑色皮质项圈，项圈上有银色太阳形吊坠，红色毛线瓜皮帽，帽子图案略有镂空，圆形墨镜，墨镜镜片颜色浅，露出眼睛。小猫左边放一盆绿叶盆栽，陶土色盆。右边一只做旧浅咖色长毛绒兔子，地上放一把有消音器的小手枪。细节写实，衣服、长毛绒兔子纹理真实。',
        imageUrl: '/images/27.jpg'
    },
    {
        id: '28',
        prompt: '保持小猫毛发质感和五官比例，生成一套复古宠物写真，复古绿色背景。小猫正面面向镜头，表情生动幸福，耳朵向上飞起，表现出开心的样子。小猫戴红色棒球帽，帽子中间有麦当劳标志，黄色短袖T恤内搭，红色口袋背带裤。小猫坐在不上漆的原木桌前，露出半身。原木桌上有夸张的巨无霸汉堡、炸鸡、薯条、可乐、麦乐鸡块。错落地放满各种品种的诱人的香肠。画面色彩浓郁对比强烈，风格童趣复古，比例适配宠物像特写，细节写实（如衣服头巾的纹理、香肠和原木桌的纹理真实）',
        imageUrl: '/images/28.jpg'
    },
    {
        id: '29',
        prompt: '以写实的视觉风格呈现的近景画面里，保持小猫造型不变。它脖子上系着红色围巾，头戴耳机，安静地站在雪地里。小猫闭着双眼，仰起头，脸上浮现出满足的微笑，似乎完全陶醉在音乐的世界中。画面光影效果细腻，雪地反射出柔和的光线，照亮了小猫毛茸茸的身体，营造出温馨的氛围。',
        imageUrl: '/images/29.jpg'
    },
    {
        id: '30',
        prompt: '保持小猫五官、毛发、造型不变。纯黄色背景，黄色购物车里装满五彩鲜花，鲜花配色白色、粉色、紫色、蓝色和一点点黄色。小猫坐在购物车中被鲜花包围，只露出头部，身体慵懒斜靠，下巴搁在黄色购物车把手上，眯眼露出得意悠闲的表情。小猫戴黄色粗框眼镜，眼镜微微下滑露出眼睛。画面色彩浓郁且对比强烈，风格童趣复古，细节写实（比如花朵和购物车的纹理质感）。',
        imageUrl: '/images/30.jpg'
    },
    {
        id: '31',
        prompt: '把背景改成橙色城堡背景 墙上贴着一些尼克和朱迪合照的系列贴纸或者海报 地毯要绿色系列配色 旁边放着 尼克狐尼克  和警官朱迪系列公仔 小猫头上带疯狂动物城系列帽子做出可爱的表情看着镜头 身上衣服要尼克胡尼克穿的衣服 表情可爱 猫窝变成城堡系列毛绒样子',
        imageUrl: '/images/39.jpg'
    },
    {
        id: '32',
        prompt: '主体只用图中小猫，其他都不要，在透明玻璃缸场景里，好奇地伸出爪子，和几条橙色金鱼互动。背景是纯净的浅蓝色，整体风格清新治愈，宠物表情呆萌可爱，画面充满童趣感。',
        imageUrl: '/images/32.jpg'
    },
    {
        id: '33',
        prompt: '小猫主体保持不变。给宝宝换上绿白格子的衣服，戴上一顶草帽，整体造型充满农场风格，显得活泼又可爱。小猫表情不变，比例不变。背景是柔和的浅绿色，地面是绿草地，场景营造出欢乐的农场氛围。周围有南瓜、玉米等农作物，还有几只鹅，仿佛置身于郊外的农场，传递出一种轻松惬意、亲近自然的感觉。',
        imageUrl: '/images/33.jpg'
    },
    {
        id: '34',
        prompt: '生成一幅具有美式复古运动氛围的画面，背景为纯净深蓝色，上方有白色和橙色文字“INTRODUCING Blantika Script CAREFULLY CRAFTED”，“Blantika Script”为复古手写风格字体，还有圆形“TRADE MARK”标识。画面主体是一只小猫，毛发清晰，穿着带白色条纹和红格纹内衬的深色连帽衣服，站在带有棕白方格图案和黄色缝线的棕色棒球手套上。周围有印着“WOODENBOX NO.3”黑色文字的木质箱子，以及棒球棒、带图案的球、小吉他等物品。',
        imageUrl: '/images/34.jpg'
    },
    {
        id: '35',
        prompt: '画面中的宠物露出可爱的神情，嘴巴微张。身穿香奈儿小香风，增添了精致感；头戴黑色的贝雷帽，整体穿搭简约又不失时尚感。宠物的动作是坐在一个白色的毛绒座椅上，姿态放松且充满童真。宠物所处的环境简洁且温馨：旁边有一个白色的毛绒兔子玩偶，增添了可爱氛围；左侧有一个黑色的气球，上面印有“Happy birthday!”的字样。背景为纯净的浅色调，简洁干净，没有多余的装饰，突出了主角与主题元素，整体营造出一种简约、温馨且充满仪式感的氛围。高清质感，写实摄影。',
        imageUrl: '/images/35.jpg'
    },
    {
        id: '36',
        prompt: '大师摄影作品，油画写实风格，这张图片呈现出一只毛茸茸的小猫，探出身子在蓝色塑料手提袋里，眼睛睁得很大，透着惊讶或疑惑的神态，更强化疑惑感。袋子上重复印着 “sweetie” 纯白色背景，全景，质感，毛发细腻，高清画质',
        imageUrl: '/images/36.jpg'
    },
    {
        id: '37',
        prompt: '把背景改成浅米色 墙上挂着赛车照片和修车工具 地上有正在维修的红色赛和配件  小猫头上别着魔镜做出酷酷的表情看着镜头身上衣服赛车皮衣 表情酷酷拽拽',
        imageUrl: '/images/37.jpg'
    },
    {
        id: '38',
        prompt: '把背景改成绿色 墙上贴满和怪兽大学这部动画片相关的贴纸和海报 海报生成毛毡质地 地毯要白色 旁边有大眼仔玩偶和毛怪 小猫头上带着毛怪的帽子 穿着毛怪的衣服 表情甜美 看着镜头。',
        imageUrl: '/images/38.jpg'
    },
    {
        id: '39',
        prompt: '保持头部不做改变，生成小猫正面趴在浅色桌面上，头戴浅棕色针织贝雷帽，身穿白色简约上衣，专注注视正前方透明袋子里的三条金鱼，有一只手拿着袋子，背景为浅灰色，整体暖色调，光影柔和，添加夕阳的效果，呈现温馨治愈的写实摄影风格，细节丰富，画面质感细腻',
        imageUrl: '/images/31.jpg'
    },
    {
        id: '40',
        prompt: '画面主体为小猫，画面上方带有“BAZAAR 文字。深蓝色背景，猫猫穿浅蓝色条纹衬衫、系带白条纹深蓝色领带，挂橙白耳机，坐在地上，表情可爱，毛发清晰，整体呈现时尚感，画面清晰，像芭莎时尚大片。',
        imageUrl: '/images/40.jpg'
    },
    {
        id: '41',
        prompt: '生成一个充满音乐氛围的萌场景：小猫身着黑色衣，头戴带白色“P”字母的黑色针织帽，佩戴银色头戴式耳机，周围摆放着印有周杰伦形象的巨型黑胶唱片、木质尤克里里以及周杰伦专辑封面卡片，打造出兼具童趣与音乐感的画面。',
        imageUrl: '/images/41.jpg'
    },
    {
        id: '42',
        prompt: '画面中的小猫身穿香奈儿小香风，增添了精致感；头戴黑色的贝雷帽，整体穿搭简约又不失时尚感。小猫的动作是坐在一个白色的毛绒座椅上，姿态放松且充满童真。小猫所处的环境简洁且温馨：旁边有一个白色的毛绒兔子玩偶，增添了可爱氛围；左侧有一个黑色的气球，上面印有“Happy birthday!”的字样。背景为纯净的浅色调，简洁干净，没有多余的装饰，突出了主角与主题元素，整体营造出一种简约、温馨且充满仪式感的氛围。高清质感，写实摄影。',
        imageUrl: '/images/42.jpg'
    },
    {
        id: '43',
        prompt: '以莫兰迪浅蓝色为背景，采用九宫格排版，展示一只宠物九种不同生日主题装扮的状态。',
        imageUrl: '/images/43.jpg'
    },
    {
        id: '44',
        prompt: '把图片改成超级玛丽的主题  背景改为立体版超级玛丽游戏方砖 ，方砖上多一些超级玛丽元素，比如问号，蘑菇之类。小猫坐姿在地面大号方砖上（方砖为黄色问号），小猫穿着超级玛丽服装，地上置放一些超级玛丽摆件和超级玛丽狗碗 ，黄色地毯，红色地毯和绿色地毯整张拼接，小猫头上戴上超级玛丽帽子，整体颜色丰富，少用咖色砖。',
        imageUrl: '/images/44.jpg'
    },
    {
        id: '45',
        prompt: '以图中小猫为主角，脖颈挂彩色的首饰，身着浅色简约吊带，惬意趴在印有白色 “Coca - Cola” 标识的红色桶内，背景是红色调，摆放着多排经典玻璃瓶装可口可乐，营造出那种可爱、创意且带品牌联动感的萌宠大片氛围，注意一定要贴近图中小猫的面部细节。',
        imageUrl: '/images/45.jpg'
    },
    {
        id: '46',
        prompt: '把背景改成哈利波特密室场景  地毯要学院风 旁边有巫师帽 扫帚 魔法棒 南瓜 猫头鹰 ，小猫头做出可爱的表情看着镜头，小猫坐着或者趴着，身上衣服风格要哈利波特学院风格。',
        imageUrl: '/images/46.jpg'
    },
    {
        id: '47',
        prompt: '主体只用图中小猫，其他都不要，在透明玻璃缸场景里，好奇地伸出爪子，和几条橙色金鱼互动。背景是纯净的浅蓝色，整体风格清新治愈，宠物表情呆萌可爱，画面充满童趣感。',
        imageUrl: '/images/47.jpg'
    },
    {
        id: '48',
        prompt: '宠物主体和姿势保持不变，穿着黑袍绿色衬里，胸口佩戴斯莱特林徽章，戴上巫师帽，搭配绿色银色条纹针织围巾，背景换成米色毛毯和旧胡桃色木地板，周围摆放魔法权杖、复古书籍、墨水瓶和羽毛，营造哈利波特魔法世界氛围。',
        imageUrl: '/images/48.jpg'
    }
]
